## import Library

In [1]:
import pandas as pd 
import numpy as np

## Array 1D

In [2]:
data_arr = np.array( [20, 25, 27, 30 ])

In [3]:
data_arr.shape

(4,)

In [4]:
data_arr[2]

27

## Series 1D

In [5]:
data = pd.Series( [20, 25, 27, 30], index = ['age_01', 'age_02', 'age_03', 'age_04'] )
data

age_01    20
age_02    25
age_03    27
age_04    30
dtype: int64

In [6]:
data.shape

(4,)

In [7]:
data['age_03']

27

## Filter Series

In [8]:
filter_age = data[data > 25]
filter_age

age_03    27
age_04    30
dtype: int64

##  Calling index of series

In [9]:
data.index

Index(['age_01', 'age_02', 'age_03', 'age_04'], dtype='object')

##  Calling values of series

In [10]:
data.values

array([20, 25, 27, 30])

## Changing index name

In [11]:
data.index = [ 'a1', 'a2', 'a3', 'a4' ]
data

a1    20
a2    25
a3    27
a4    30
dtype: int64

## Rename index

In [12]:
rename_index = data.rename( {'a2': 'age_02'} )
rename_index

a1        20
age_02    25
a3        27
a4        30
dtype: int64

## Dataframe

In [13]:
df = np.array( [ [20, 25, 27, 30], [10, 8, 5, 9], [8, 10, 3, 7] ] )
df

array([[20, 25, 27, 30],
       [10,  8,  5,  9],
       [ 8, 10,  3,  7]])

In [14]:
df.shape

(3, 4)

In [15]:
type(df)

numpy.ndarray

In [16]:
data_set = pd.DataFrame(df)
data_set

    0   1   2   3
0  20  25  27  30
1  10   8   5   9
2   8  10   3   7

In [17]:
data_set = data_set.transpose()

In [18]:
data_set

    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  30   9   7

In [20]:
data_set.index = ['s1', 's2', 's3', 's4']

In [25]:
data_set.columns = [ 'Age', 'Grade Data', 'Grade Science']

In [26]:
data_set

    Age  Grade Data  Grade Science
s1   20          10              8
s2   25           8             10
s3   27           5              3
s4   30           9              7

In [27]:
data_set.index

Index(['s1', 's2', 's3', 's4'], dtype='object')

In [28]:
data_set.columns

Index(['Age', 'Grade Data', 'Grade Science'], dtype='object')

In [32]:
data_set['Grade Data']

s1    10
s2     8
s3     5
s4     9
Name: Grade Data, dtype: int64

## loc (Label Based Locating) and iloc (Integer Based Locating)

In [39]:
data_set.loc['s2']

Age              25
Grade Data        8
Grade Science    10
Name: s2, dtype: int64

In [48]:
data_set.loc[['s1', 's3']]

    Age  Grade Data  Grade Science
s1   20          10              8
s3   27           5              3

In [49]:
data_set.loc['s1':'s3']

    Age  Grade Data  Grade Science
s1   20          10              8
s2   25           8             10
s3   27           5              3

In [55]:
data_set.iloc[1][2]

10

In [56]:
data_set.loc['s2']['Grade Science']

10

In [57]:
data_set

    Age  Grade Data  Grade Science
s1   20          10              8
s2   25           8             10
s3   27           5              3
s4   30           9              7

In [59]:
data_set.iloc[1:3]

    Age  Grade Data  Grade Science
s2   25           8             10
s3   27           5              3

In [62]:
data_set.iloc[:,0:2]

    Age  Grade Data
s1   20          10
s2   25           8
s3   27           5
s4   30           9

## Drop in Pandas

In [63]:
drop_column = data_set.drop('Grade Data', axis = 1)
drop_column

    Age  Grade Science
s1   20              8
s2   25             10
s3   27              3
s4   30              7

In [65]:
replace_data = data_set.replace(10, 12)
replace_data

    Age  Grade Data  Grade Science
s1   20          12              8
s2   25           8             12
s3   27           5              3
s4   30           9              7

In [66]:
replace_multiple_data = data_set.replace( {20: 'Twenty',
                                          25: 'Twenty Five'})
replace_multiple_data

            Age  Grade Data  Grade Science
s1       Twenty          10              8
s2  Twenty Five           8             10
s3           27           5              3
s4           30           9              7

## Sort Index and Sort Values

In [67]:
data_set.sort_values('Grade Data', ascending = True)

    Age  Grade Data  Grade Science
s3   27           5              3
s2   25           8             10
s4   30           9              7
s1   20          10              8

In [68]:
data_set.sort_index(axis = 0, ascending = False)

    Age  Grade Data  Grade Science
s4   30           9              7
s3   27           5              3
s2   25           8             10
s1   20          10              8

In [69]:
data_set.head()

    Age  Grade Data  Grade Science
s1   20          10              8
s2   25           8             10
s3   27           5              3
s4   30           9              7

In [71]:
data_set.tail()

    Age  Grade Data  Grade Science
s1   20          10              8
s2   25           8             10
s3   27           5              3
s4   30           9              7

In [72]:
new_data = pd.read_csv('./Data_Set.csv')

In [73]:
new_data

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12
9,7,19,28,14,-14,12
10,8,22,29,12,-15,9
11,9,25,26,12,-12,8
12,10,26,24,14,-8,8
13,11,27,20,14,-4,8
14,12,30,19,16,0,5
15,13,30,19,16,0,4
16,14,NaN,13,17,2,4
17,15,27,14,17,3,4
18,16,27,16,17,2,6
19,17,28,-4,18,0,8
20,18,33,26,20,-6,9
21,19,42,32,21,-8,10
22,20,120,33,21,-12,12
23,21,47,32,21,-16,12
24,22,44,30,22,-18,12
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12

In [74]:
new_data.head()

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12

In [75]:
new_data.tail()

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
22,20,120,33,21,-12,12
23,21,47,32,21,-16,12
24,22,44,30,22,-18,12
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12